import getRandomInRange from "../utils/random.js";

export default function mutateGenome(genome) {
  let newgenome = [...genome]; // копіює геном і повертає його зміненою копією. Не змінює оригінальний геном. Не змінює екземпляр класу. Не повертає новий екземпляр класу. Не повертає результат зміни оригінального геному. Не повертає результат зміни екземпляра класу. Не повертає результат зміни оригінальног
  newgenome[Math.round(getRandomInRange(0, 63))] = Math.round(
    getRandomInRange(0, 63)
  );

  return newgenome; // змінює копію геному і повертає його зміненою копією. Не змінює оригінальний геном. Не змінює екземпляр класу. Не повертає новий екземпляр класу. Не повертає результат зміни оригінального геному. Не повертає результат зміни екземпляра клас
}
